Revit 2024 API
RevolvedSurface.Origin Property
 Center of the circle that defines the base of the revolved surface. This is the origin of the local coordinate system associated with this revolved surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public XYZ Origin { get; }
Visual Basic
Public ReadOnly Property Origin As XYZ
	Get
Visual C++
public:
property XYZ^ Origin {
	XYZ^ get ();
}
See Also
RevolvedSurface Class
Autodesk.Revit.DB Namespace